// Самое важное в JavaScript это: выражения, функции и объекты. Практические все сущности в JavaScript - объекты. Объект - набор свойств "имя: значение".
// Пример объекта
// {
// visible: true,
// colorDepth: 24,
// title: 'My Image',
// orientation: {               "это
// angle: 0,                     вложенный
// type: 'landscape'             объект"
// },
// pixelDepth: 24,
// width: 1440
// }
// Массив, фукнция, число, строка - это Объекты(они ведут себя как объекты).
// console.log('Hello World'); console - это объект. log - это метод. Метод это функция, к-рая является значением одного из свойств объекта. Точка между console и log это синтаксис JavaScript, к-рая называется Точечная запись. С помощью точечной записи можно получать доступ к свойствам объекта. Скобки () это Вызов метода. Внутри вызова метода находится Аргумент.
// console.dir() отображает все свойства объекта.
// console.table() отображает все свойства объекта в табличном виде.
// Выражения всегда возвращают значения. Примеры выражений:
// 'abc'    ()
// 10       ()
